Revit 2027 API
RoutingConditions.AppendCondition Method
 Appends a routing condition to the end of existing routing conditions. Note that the first item (indexed at 0) is the condition for the primary connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AppendCondition(
	RoutingCondition condition
)
Public Sub AppendCondition (
	condition As RoutingCondition
)
public:
void AppendCondition(
	RoutingCondition^ condition
)
member AppendCondition :
        condition : RoutingCondition -> unit
Parameters
condition RoutingCondition
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RoutingConditions Class
Autodesk.Revit.DB Namespace